LeeYeoNyeong/Hybrid-PQC-TLS-STM32/wolfSSL/wolfSSL.I-CUBE-wolfSSL_conf.h
/**
  ******************************************************************************
  * File Name          : wolfSSL.I-CUBE-wolfSSL_conf.h
  * Description        : This file provides code for the configuration
  *                      of the wolfSSL.I-CUBE-wolfSSL_conf.h instances.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __WOLFSSL_I_CUBE_WOLFSSL_CONF_H__
#define __WOLFSSL_I_CUBE_WOLFSSL_CONF_H__

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/

/**
    MiddleWare name : wolfSSL.I-CUBE-wolfSSL.5.8.4
    MiddleWare fileName : wolfSSL.I-CUBE-wolfSSL_conf.h
    MiddleWare version :
*/
/*---------- WOLF_CONF_DEBUG -----------*/
#define WOLF_CONF_DEBUG      0

/*---------- WOLF_CONF_WOLFCRYPT_ONLY -----------*/
#define WOLF_CONF_WOLFCRYPT_ONLY      0

/*---------- WOLF_CONF_TLS13 -----------*/
#define WOLF_CONF_TLS13      1

/*---------- WOLF_CONF_TLS12 -----------*/
#define WOLF_CONF_TLS12      1

/*---------- WOLF_CONF_DTLS -----------*/
#define WOLF_CONF_DTLS      0

/*---------- WOLF_CONF_MATH -----------*/
#define WOLF_CONF_MATH      4

/*---------- WOLF_CONF_RTOS -----------*/
#define WOLF_CONF_RTOS      2

/*---------- WOLF_CONF_RNG -----------*/
#define WOLF_CONF_RNG      1

/*---------- WOLF_CONF_RSA -----------*/
#define WOLF_CONF_RSA      1

/*---------- WOLF_CONF_ECC -----------*/
#define WOLF_CONF_ECC      1

/*---------- WOLF_CONF_DH -----------*/
#define WOLF_CONF_DH      1

/*---------- WOLF_CONF_AESGCM -----------*/
#define WOLF_CONF_AESGCM      1

/*---------- WOLF_CONF_AESCBC -----------*/
#define WOLF_CONF_AESCBC      0

/*---------- WOLF_CONF_CHAPOLY -----------*/
#define WOLF_CONF_CHAPOLY      1

/*---------- WOLF_CONF_EDCURVE25519 -----------*/
#define WOLF_CONF_EDCURVE25519      1

/*---------- WOLF_CONF_MD5 -----------*/
#define WOLF_CONF_MD5      0

/*---------- WOLF_CONF_SHA1 -----------*/
#define WOLF_CONF_SHA1      0

/*---------- WOLF_CONF_SHA2_224 -----------*/
#define WOLF_CONF_SHA2_224      0

/*---------- WOLF_CONF_SHA2_256 -----------*/
#define WOLF_CONF_SHA2_256      1

/*---------- WOLF_CONF_SHA2_384 -----------*/
#define WOLF_CONF_SHA2_384      1

/*---------- WOLF_CONF_SHA2_512 -----------*/
#define WOLF_CONF_SHA2_512      1

/*---------- WOLF_CONF_SHA3 -----------*/
#define WOLF_CONF_SHA3      1

/*---------- WOLF_CONF_PSK -----------*/
#define WOLF_CONF_PSK      0

/*---------- WOLF_CONF_PWDBASED -----------*/
#define WOLF_CONF_PWDBASED      0

/*---------- WOLF_CONF_KEEP_PEER_CERT -----------*/
#define WOLF_CONF_KEEP_PEER_CERT      0

/*---------- WOLF_CONF_BASE64_ENCODE -----------*/
#define WOLF_CONF_BASE64_ENCODE      0

/*---------- WOLF_CONF_OPENSSL_EXTRA -----------*/
#define WOLF_CONF_OPENSSL_EXTRA      0

/*---------- WOLF_CONF_TEST -----------*/
#define WOLF_CONF_TEST      1

/*---------- WOLF_CONF_KYBER -----------*/
#define WOLF_CONF_KYBER      1

/*---------- WOLF_CONF_ARMASM -----------*/
#define WOLF_CONF_ARMASM      0

/*---------- WOLF_CONF_IO -----------*/
#define WOLF_CONF_IO      2

/*---------- WOLF_CONF_RESUMPTION -----------*/
#define WOLF_CONF_RESUMPTION      0

/*---------- WOLF_CONF_TPM -----------*/
#define WOLF_CONF_TPM      0

/*---------- WOLF_CONF_PK -----------*/
#define WOLF_CONF_PK      0

/* ------------------------------------------------------------------------- */
/* Hardware platform */
/* ------------------------------------------------------------------------- */
/* Setup default (No crypto hardware acceleration or TLS UART test).
 * Use undef in platform section to enable it.
 */
#define NO_STM32_HASH
#define NO_STM32_CRYPTO
#define NO_TLS_UART_TEST

#if defined(STM32WB55xx)
    #define WOLFSSL_STM32WB
    #define WOLFSSL_STM32_PKA
    #undef  NO_STM32_CRYPTO
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart1
    #endif
#elif defined(STM32WBA52xx)
    #define WOLFSSL_STM32WBA
    #define WOLFSSL_STM32_PKA
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    /* NUCLEO-WBA52CG USART1 (TX=PB12 / RX=PA8) */
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart1
    #endif
#elif defined(STM32WL55xx)
    #define WOLFSSL_STM32WL
    #define WOLFSSL_STM32_PKA
    #undef  NO_STM32_CRYPTO
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart2
    #endif
#elif defined(STM32F407xx)
    #define WOLFSSL_STM32F4
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart2
    #endif
#elif defined(STM32F437xx) || defined(STM32F439xx)
    #define WOLFSSL_STM32F4
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #define STM32_HAL_V2
    #ifndef HAL_CONSOLE_UART
        #ifdef STM32F439xx
        #define HAL_CONSOLE_UART huart3
        #else
        #define HAL_CONSOLE_UART huart4
        #endif
    #endif
#elif defined(STM32F777xx)
    #define WOLFSSL_STM32F7
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #define STM32_HAL_V2
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart2
    #endif
#elif defined(STM32F756xx)
    #define WOLFSSL_STM32F7
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #define STM32_HAL_V2
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart3
    #endif
#elif defined(STM32H7S3xx)
    #define WOLFSSL_STM32H7S
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #define WOLFSSL_STM32_PKA
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart3
    #endif
#elif defined(STM32H753xx)
    #define WOLFSSL_STM32H7
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart3
    #endif
#elif defined(STM32H723xx) || defined(STM32H725xx) || defined(STM32H743xx)
    #define WOLFSSL_STM32H7
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart3
    #endif
#elif defined(STM32L4A6xx)
    #define WOLFSSL_STM32L4
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART hlpuart1
    #endif
#elif defined(STM32L475xx)
    #define WOLFSSL_STM32L4
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart1
    #endif
#elif defined(STM32L562xx)
    #define WOLFSSL_STM32L5
    #define WOLFSSL_STM32_PKA
    #undef  NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart1
    #endif
#elif defined(STM32L552xx)
    #define WOLFSSL_STM32L5
    #undef  NO_STM32_HASH
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART hlpuart1
    #endif
#elif defined(STM32F207xx)
    #define WOLFSSL_STM32F2
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart3
    #endif
#elif defined(STM32F217xx)
    #define WOLFSSL_STM32F2
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart2
    #endif
#elif defined(STM32F107xC)
    #define WOLFSSL_STM32F1
    #define NO_STM32_RNG
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart4
    #endif
#elif defined(STM32F401xE)
    #define WOLFSSL_STM32F4
    #define NO_STM32_RNG
    #define WOLFSSL_GENSEED_FORTEST /* no HW RNG is available use test seed */
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart2
    #endif
#elif defined(STM32G071xx)
    #define WOLFSSL_STM32G0
    #define NO_STM32_RNG
    #define WOLFSSL_GENSEED_FORTEST /* no HW RNG is available use test seed */
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart2
    #endif
#elif defined(STM32G491xx)
    #define WOLFSSL_STM32G4
    #define HAL_CONSOLE_UART hlpuart1
#elif defined(STM32U575xx) || defined(STM32U585xx) || defined(STM32U5A9xx)
    #define WOLFSSL_STM32U5
    #define STM32_HAL_V2
    #if defined(STM32U585xx) || defined(STM32U5A9xx)
        #undef  NO_STM32_HASH
        #undef  NO_STM32_CRYPTO
        #define WOLFSSL_STM32_PKA
    #endif
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart1
    #endif
#elif defined(STM32H563xx)
    #define WOLFSSL_STM32H5
    #define STM32_HAL_V2
    #undef  NO_STM32_HASH
    #define WOLFSSL_STM32_PKA
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart3
    #endif
#elif defined(STM32MP135Fxx)
    #define WOLFSSL_STM32MP13
    #define STM32_HAL_V2
    #undef NO_STM32_HASH
    #undef NO_STM32_CRYPTO
    #define WOLFSSL_STM32_PKA
    #define WOLFSSL_STM32_PKA_V2
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart4
    #endif
#elif defined(STM32N657xx)
    #define WOLFSSL_STM32N6
    #define STM32_HAL_V2
    #undef NO_STM32_HASH
    #undef NO_STM32_CRYPTO
    #define WOLFSSL_STM32_PKA
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart1
    #endif
#else
    #warning Please define a hardware platform!
    /* This means there is not a pre-defined platform for your board/CPU */
    /* You need to define a CPU type, HW crypto and debug UART */
    /* CPU Type: WOLFSSL_STM32F1, WOLFSSL_STM32F2, WOLFSSL_STM32F4,
        WOLFSSL_STM32F7, WOLFSSL_STM32H7, WOLFSSL_STM32L4, WOLFSSL_STM32L5,
        WOLFSSL_STM32G0, WOLFSSL_STM32G4, WOLFSSL_STM32WB, WOLFSSL_STM32U5 and
        WOLFSSL_STM32MP13 */
    #define WOLFSSL_STM32F4

    /* Debug UART used for printf */
    /* The UART interface number varies for each board/CPU */
    /* Typically this is the UART attached to the ST-Link USB CDC UART port */
    #ifndef HAL_CONSOLE_UART
    #define HAL_CONSOLE_UART huart4
    #endif

