LeeYeoNyeong/Hybrid-PQC-TLS-STM32/wolfSSL/wolfSSL.I-CUBE-wolfSSL_conf.h
    #undef  WOLFSSL_NO_SHAKE256
    #undef  WOLFSSL_SHAKE256
    #define WOLFSSL_SHAKE256

    #undef  WOLFSSL_SHA3
    #define WOLFSSL_SHA3
#endif /* WOLF_CONF_KYBER */

/* ML-DSA (Dilithium) – keygen + sign + verify enabled for cert_bench_task */
#undef  WOLFSSL_EXPERIMENTAL_SETTINGS
#define WOLFSSL_EXPERIMENTAL_SETTINGS
#undef  HAVE_DILITHIUM
#define HAVE_DILITHIUM
#undef  WOLFSSL_WC_DILITHIUM
#define WOLFSSL_WC_DILITHIUM

/* Falcon – verify-only (no liboqs), Level 1 (512) + Level 5 (1024) */
/* Note: HAVE_PQC must NOT be defined directly; wolfSSL settings.h sets it
 * automatically when HAVE_FALCON (or HAVE_DILITHIUM etc.) is defined. */
#undef  HAVE_FALCON
#define HAVE_FALCON

/* SPHINCS+ verify-only (SHAKE variants: fast/small × L1/L3/L5) */
#undef  HAVE_SPHINCS
#define HAVE_SPHINCS

/* Sig-size cap for SPHINCS+ fast variants:
 *   L1=17088B, L3=35664B, L5=49856B
 * WOLFSSL_MAX_HANDSHAKE_SZ is only a size-check limit (tls13.c:maxSigSz),
 * NOT a static buffer — no heap impact. Set to 65536 so L5 passes. */
#ifndef WOLFSSL_MAX_HANDSHAKE_SZ
#define WOLFSSL_MAX_HANDSHAKE_SZ (65536)
#endif

/* WOLFSSL_DILITHIUM_NO_MAKE_KEY removed: cert_bench_task needs keygen */
/* Use small-memory verification path: processes matrix A one column at a time
 * using ~12KB peak instead of 57KB (cache) or 82KB (single block).
 * This fixes CHAMELEON_L5 which fails with MEMORY_E when importing ML-DSA-87
 * pubkey because heap is more depleted by the large DCD-extension leaf cert.
 * WC_DILITHIUM_CACHE_MATRIX_A removed: redundant when VERIFY_SMALL_MEM is used
 * (VERIFY_SMALL_MEM recomputes A per column; cached A is never used). */
#define WOLFSSL_DILITHIUM_VERIFY_SMALL_MEM
/* WOLFSSL_DILITHIUM_NO_SIGN removed: DUAL_ALG_CERTS needs ML-DSA verify via ConfirmSignature */
/* SHAKE-128 and SHAKE-256 required by Dilithium */
#undef  WOLFSSL_NO_SHAKE128
#undef  WOLFSSL_SHAKE128
#define WOLFSSL_SHAKE128
#undef  WOLFSSL_NO_SHAKE256
#undef  WOLFSSL_SHAKE256
#define WOLFSSL_SHAKE256

/* Catalyst hybrid cert support: parses sapki/altSigAlg/altSigVal extensions */
#define WOLFSSL_DUAL_ALG_CERTS
/* Custom 0xFF10 extension + type-250 PQCertificateVerify handler */
#define WOLFSSL_HYBRID_CERT
/* OQS composite hybrid certs (p256_mldsa44 / p384_mldsa65 / p521_mldsa87) */
#define WOLFSSL_COMPOSITE_CERTS
/* Enable peer cert chain access after handshake (needed for RelatedCertificate validation) */
#define SESSION_CERTS

/* ------------------------------------------------------------------------- */
/* Crypto Acceleration */
/* ------------------------------------------------------------------------- */
/* This enables inline assembly speedups for SHA2, SHA3, AES,
 * ChaCha20/Poly1305 and Ed/Curve25519. These settings work for Cortex M4/M7
 * and the source code is located in wolfcrypt/src/port/arm/
 */
#if defined(WOLF_CONF_ARMASM) && WOLF_CONF_ARMASM == 1
    #define WOLFSSL_ARMASM
    #define WOLFSSL_ARMASM_INLINE
    #define WOLFSSL_ARMASM_NO_HW_CRYPTO
    #define WOLFSSL_ARMASM_NO_NEON
    #define WOLFSSL_ARMASM_THUMB2
    #define WOLFSSL_ARM_ARCH 7
    /* Disable H/W offloading if accelerating S/W crypto */
    #undef  NO_STM32_HASH
    #define NO_STM32_HASH
    #undef  NO_STM32_CRYPTO
    #define NO_STM32_CRYPTO
#endif

/* ------------------------------------------------------------------------- */
/* Benchmark / Test */
/* ------------------------------------------------------------------------- */
/* Use reduced benchmark / test sizes */
#define BENCH_EMBEDDED
#define USE_CERT_BUFFERS_2048
#define USE_CERT_BUFFERS_256

/* ------------------------------------------------------------------------- */
/* Debugging */
/* ------------------------------------------------------------------------- */
#if defined(WOLF_CONF_DEBUG) && WOLF_CONF_DEBUG == 1
    #define DEBUG_WOLFSSL

    /* Use this to measure / print heap usage */
    #if 0
        #define USE_WOLFSSL_MEMORY
        #define WOLFSSL_TRACK_MEMORY
        #define WOLFSSL_DEBUG_MEMORY
        #define WOLFSSL_DEBUG_MEMORY_PRINT
    #endif
#else
    //#define NO_WOLFSSL_MEMORY
    //#define NO_ERROR_STRINGS
#endif

/* ------------------------------------------------------------------------- */
/* Port */
/* ------------------------------------------------------------------------- */

/* Override Current Time */
/* Allows custom "custom_time()" function to be used for benchmark */
#define WOLFSSL_USER_CURRTIME

/* ------------------------------------------------------------------------- */
/* RNG */
/* ------------------------------------------------------------------------- */
#define NO_OLD_RNGNAME /* conflicts with STM RNG macro */
#if !defined(WOLF_CONF_RNG) || WOLF_CONF_RNG == 1
    /* default is enabled */
    #define HAVE_HASHDRBG
#else /* WOLF_CONF_RNG == 0 */
    #define WC_NO_HASHDRBG
    #define WC_NO_RNG
#endif

/* ------------------------------------------------------------------------- */
/* Disable Features */
/* ------------------------------------------------------------------------- */
#if defined(WOLF_CONF_TLS12) && WOLF_CONF_TLS12 == 0
    #define WOLFSSL_NO_TLS12
#endif
#if defined(WOLF_CONF_WOLFCRYPT_ONLY) && WOLF_CONF_WOLFCRYPT_ONLY == 1
    #define WOLFCRYPT_ONLY
#endif
//#define NO_WOLFSSL_SERVER
//#define NO_WOLFSSL_CLIENT

#if defined(WOLF_CONF_TEST) && WOLF_CONF_TEST == 0
    #define NO_CRYPT_TEST
    #define NO_CRYPT_BENCHMARK
#endif

#define NO_FILESYSTEM
#define NO_WRITEV
#define NO_MAIN_DRIVER
#define NO_DEV_RANDOM
#define NO_OLD_TLS
#define WOLFSSL_NO_CLIENT_AUTH /* disable client auth for Ed25519/Ed448 */

#define NO_DSA
#define NO_RC4
#define NO_MD4
#define NO_DES3

#ifndef WOLFSSL_SHAKE128
#define WOLFSSL_NO_SHAKE128
#endif

#ifndef WOLFSSL_SHAKE256
#define WOLFSSL_NO_SHAKE256
#endif

/* In-lining of misc.c functions */
/* If defined, must include wolfcrypt/src/misc.c in build */
/* Slower, but about 1k smaller */
//#define NO_INLINE

/* Base16 / Base64 encoding */
//#define NO_CODING

#ifdef __cplusplus
}
#endif
#endif /* WOLFSSL_I_CUBE_WOLFSSL_CONF_H_H */

/**
  * @}
  */

/*****END OF FILE****/
